Revit 2026 API

# ModelTextText Property

---

The text string in the model text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Text { get; set; }
```
```vb
Public Property Text As String
	Get
	Set
```
```cpp
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Text : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is assigned to text. |
| ArgumentException | Thrown when an empty string is assigned to text. |

#### Reference

ModelText Class

Autodesk.Revit.DB Namespace